[{"title":"Indian Economy","imageUrl":"https://rukminim1.flixcart.com/image/416/416/l4ssfww0/regionalbooks/b/6/x/indian-economy-english-1st-edition-for-upsc-cse-prelims-mains-by-original-imagfm5peczatstg.jpeg?q=70","description":"Indian Economy launched by Study IQ Publications aims to address the syllabus of Economy holistically from the UPSC Civil Services Examinations perspective. The book has been updated as per the latest examination pattern and is also suitable for all competitive examinations","price":"110"},{"title":"GK/GS Book For SSC CGL, GD, CHSL, MTS, Railways","imageUrl":"https://rukminim1.flixcart.com/image/416/416/xif0q/regionalbooks/t/j/o/gk-gs-book-for-ssc-cgl-gd-chsl-mts-railways-state-delhi-police-original-imagg7yh3ybfh2f4.jpeg?q=70","description":"\"It is very important to have a strong grip on GK/GS to crack any government exam. Having good knowledge of this subject, students can easily take up the selection with the changing trends and changing pattern of the exam","price":"290"},{"title":"Shiv Puran Sampurna ","imageUrl":"https://rukminim1.flixcart.com/image/416/416/k2nmaa80/regionalbooks/q/w/w/shiv-puran-sampurna-11-khand-and-7-sanhitas-large-fonts-easy-original-imafhxrzenffq58w.jpeg?q=70","description":"\r\nThe Shiva Purana is one of eighteen Purana genre of Sanskrit language in Hinduism, and part of the Shaivism literature corpus. It primarily centers around the Hindu god Shiva and goddess Parvati,","price":"650"},{"title":"NEET Previous Years Solved Papers With Solutions","imageUrl":"https://rukminim1.flixcart.com/image/416/416/xif0q/regionalbooks/9/u/b/neet-previous-years-solved-papers-with-solutions-2013-2022-14-original-imaggtewkymwzjgc.jpeg?q=70","description":"\r\nThe crucial part for better preparation is choosing the best book for NEET 2021. Target’s NEET - UG Previous Year Question Paper book will give you a head start and cut down the effort that you would otherwise have to put in to find the right strategy and the best books in the market","price":"400"}]